src/Documents/ОплатаАренды/ОплатаАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаАренды</name>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ОплатаАренды/ManagerModule.bsl
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//      ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//      Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
        //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
        Макет = ПолучитьОбщийМакет("ЧекПоОперации");
        Запрос = Новый Запрос;
        Запрос.Текст =
                "ВЫБРАТЬ
                |	""№ "" + СТРОКА(ОплатаАренды.Номер) КАК Номер,
                |	ПОДСТРОКА(СТРОКА(ОплатаАренды.Дата), 1, 10) КАК Дата,
                |	СТРОКА(ОплатаАренды.Скидка) + ""%"" КАК Скидка,
                |	ОплатаАренды.ВремяАренды КАК ВремяАренды,
                |	ОплатаАренды.СуммаОплаты КАК СуммаОплаты,
                |	ОплатаАренды.Тариф * ОплатаАренды.ВремяАренды КАК СуммаБезСкидки,
                |	ОплатаАренды.Клиент.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
                |	ОплатаАренды.Клиент.ФИО КАК Имя,
                |	""Чек по операции аренда товара "" + ОплатаАренды.Товар.Наименование + "", артикул "" + ОплатаАренды.Товар.Код КАК
                |		Заголовок
                |ИЗ
                |	Документ.ОплатаАренды КАК ОплатаАренды
                |ГДЕ
                |	ОплатаАренды.Ссылка В (&Ссылка)";
        Запрос.Параметры.Вставить("Ссылка", Ссылка);
        Выборка = Запрос.Выполнить().Выбрать();

        Основная = Макет.ПолучитьОбласть("Основная");

        ТабДок.Очистить();

        ВставлятьРазделительСтраниц = Ложь;
        Пока Выборка.Следующий() Цикл
                Если ВставлятьРазделительСтраниц Тогда
                        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
                КонецЕсли;

                Основная.Параметры.Заполнить(Выборка);
                Основная.Параметры.ПочтаОтправления = ПосылкаПочтыВызовСервера.ОсновнойАдресПочты();
                ТабДок.Вывести(Основная);
                ВставлятьРазделительСтраниц = Истина;
        КонецЦикла;
        //}}
КонецПроцедуры
